<a href="https://colab.research.google.com/github/SzMK/BioD/blob/master/connect_to_database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Downloading the example database and connecting to it

## Packages needed for this project

In [ ]:
import urllib.request    # needed for download of the example database
import shutil            # needed for unziping of the example database

from sqlalchemy import * # package providing unified access to various databases

import pandas as pd      # for better table visualisation

## Downloading of the example database

The SQLite tutorial example database is provided as a `zip` archive in `chinook.zip` file. Download it from the [SQLite tutorial web site](https://www.sqlitetutorial.net) (for example using the following Python command):

In [ ]:
urllib.request.urlretrieve("https://www.sqlitetutorial.net/wp-content/uploads/2018/03/chinook.zip", "chinook.zip")

*Checkpoint:* The current directory should contain now `chinook.zip` file. Next, unpack the `zip` archive (for example using Python the following Python command):

In [ ]:
shutil.unpack_archive("chinook.zip")

*Checkpoint:* The current directory should contain now `chinook.db` file. This is the example database in SQLite format.

## Connect to the database and execute an SQL query

The following text:

> SELECT * FROM albums LIMIT 5

is one of the simplest possible queries in SQL. It requests to provide all (`*`) columns and `5` rows from the database table `albums`. 

In a Python notebook there are several ways to connect to a database and execute the query. These methods differ in type of the object used to return the query result. Study the following examples.

### Using SQLAlchemy engine object

Open the connection to the SQLite database in the `chinook.db` file by creating the database `engine` connector object as follows:

In [ ]:
# To get the engine object import create_engine function from SQLAlchemy package:
# 
# from sqlalchemy import create_engine 
#
engine = create_engine("sqlite:///chinook.db")

Using the following code you may send an SQL query `sql` to the database through the `engine` connector.  
In the `arr` variable you will get the resulting table provided as a list of tuples.

In [ ]:
sql = text("SELECT * FROM albums LIMIT 5")
arr = engine.execute(sql).fetchall()
arr

The following code will execute the same `sql` query through the `engine` but the result will be provided as a Panda's `DataFrame` object in the variable `df`.

In [ ]:
# For this method import pandas package:
#
# import pandas as pd
#
sql = text("SELECT * FROM albums LIMIT 5")
df = pd.read_sql(sql, engine)
df

### Using Python magic connector

When the Python script works with a single database only and extra Python language extensions are allowed the following notation might be used. The following code creates the database engine connector object in a hidden variable and allows for the magic `%sql` to be used in the code chunks.

In [ ]:
%load_ext sql
%sql sqlite:///chinook.db

Using the magic sql connector this is a short way to execute a directly typed single line SQL query and print the result:

In [ ]:
%sql SELECT * FROM albums LIMIT 5

The following code may be used to convert the result to Panda's `DataFrame`:

In [ ]:
res = %sql SELECT * FROM albums LIMIT 5
df = res.DataFrame()
df

To print results of longer SQL commands which do not fit in a single line use double-percent notation `%%sql` as below:

In [ ]:
%%sql
SELECT trackid, composer, unitprice FROM tracks LIMIT 5

### By Mo

**Order By:**

To sort the result set, you add the ORDER BY clause to the  SELECT statement. 

*The ORDER BY clause comes after the FROM clause.* 

*   The `ASC` keyword means ascending.

*   And the `DESC` keyword means descending.

*Note: If you don’t specify the ASC or DESC keyword, SQLite sorts the result set using the ASC option. In other words, it sorts the result set in the ascending order by default.*

Suppose you want to sort the result set based on `AlbumId` column in **ascending** order, you use the following statement:

In [ ]:
 %%sql 
 SELECT 
  name,
	milliseconds, 
	albumid
FROM
	tracks
ORDER BY
	albumid ASC

Suppose you want to sort the sorted result (by `AlbumId`) above by the `Milliseconds` column in **descending** order. In this case, you need to add the `Milliseconds` column to the `ORDER BY` clause as follows:

*SQLite sorts rows by `AlbumId` column in ascending order first. Then, it sorts the sorted result set by the `Milliseconds` column in descending order.*

In [ ]:
 %%sql 
 SELECT 
  name,
	milliseconds, 
	albumid
FROM
	tracks
ORDER BY
	albumid ASC,
  milliseconds DESC

**Sorting NULLs**

SQLite considers NULL to be smaller than any other value.
It means that NULLs will appear at the beginning of the result set if you use ASC or at the end of the result set when you use DESC.

SQLite 3.30.0 added the `NULLS FIRST` and `NULLS LAST` options to the `ORDER BY`clause. The `NULLS FIRST` option specifies that the NULLs will appear at the beginning of the result set while the `NULLS LAST` option place NULLs at the end of the result set.

In [ ]:
%%sql
SELECT 
  name,
	trackid, 
	Composer
FROM
	tracks
ORDER BY
 Composer

The following example uses the `NULLS LAST` option to place NULLs after other values:

In [ ]:
%%sql
SELECT 
  name,
	trackid, 
	Composer
FROM
	tracks
ORDER BY
  Composer NULLS LAST

**Filtering out**

The `DISTINCT` clause allows you to remove the duplicate rows in the result set.

In [ ]:
%%sql
SELECT city
FROM customers
ORDER BY city
Limit 10

In [ ]:
%%sql
SELECT  DISTINCT city
FROM customers
ORDER BY city
Limit 10

**SQLite SELECT DISTINCT with NULL example**

This statement returns the names of companies of customers from the `customers` 
table.

In [ ]:
%%sql
SELECT company
FROM customers;

Now, if you apply the `DISTINCT` clause to the statement, it will keep only one row with a `NULL` value.

In [ ]:
%%sql
SELECT DISTINCT company
FROM customers;

**WHERE clause**

Add a `WHERE` clause to the `SELECT` statement to filter rows returned by the query.

The following query uses the `WHERE` clause the equality operator to find all the tracks in the album id 1:

In [ ]:
%%sql
SELECT
  name,
	milliseconds, 
	bytes,
  albumid
FROM 
  tracks 
WHERE
  albumid = 1

**SQLite comparison operators**

Equal to =

Not equal to <>or!=

Less than <

Greater than > 

Less than or equal to <= 

Greater than or equal to >=

**SQLite logical operators**


**ALL**	returns 1 if all expressions are 1.

**AND**	returns 1 if both expressions are 1, and 0 if one of the expressions is 0.

**ANY**	returns 1 if any one of a set of comparisons is 1.

**BETWEEN**	returns 1 if a value is within a range.

**EXISTS**	returns 1 if a subquery contains any rows.

**IN**	returns 1 if a value is in a list of values.

**LIKE**	returns 1 if a value matches a pattern

**NOT**	reverses the value of other operators such as NOT EXISTS, NOT IN, NOT BETWEEN, etc.

**OR**	returns true if either expression is 1

 To get tracks of the album 1 that have the length greater than 200,000 milliseconds, you use the following statement:

In [ ]:
%%sql
SELECT
	name,
	milliseconds,
	bytes,
	albumid
FROM
	tracks
WHERE
	albumid = 1
AND milliseconds > 250000

**SQLite `WHERE` clause with `LIKE` operator example**


Sometimes, you may not remember exactly the data that you want to search. In this case, you perform an inexact search using the `LIKE` operator.

For example, to find which tracks composed by Smith, you use the `LIKE` operator as follows:

In [ ]:
%%sql
SELECT
	name,
	albumid,
	composer
FROM
	tracks
WHERE
	composer LIKE '%Smith%'
ORDER BY
	albumid

**SQLite WHERE clause with the `IN` operator example**

The `IN` operator allows you to check whether a value is in a list of a comma-separated list of values. For example, to find tracks that have media type id is 2 or 3, you use the `IN` operator as shown in the following statement:

In [ ]:
%%sql
SELECT
	name,
	albumid,
	mediatypeid
FROM
	tracks
WHERE
	mediatypeid IN (2, 3)


**LIMIT**
to get the first 10 rows in the `tracks` table, you use the following statement:

In [ ]:
%%sql
SELECT
	trackId,
	name
FROM
	tracks
LIMIT 10;

If you want to get the first 10 rows starting from the 10th row of the result set, you use `OFFSET` keyword as the following:

In [ ]:
%%sql
SELECT
	trackId,
	name
FROM
	tracks
LIMIT 10 OFFSET 10

Or you can use the following shorthand syntax of the` LIMIT OFFSET` clause:

`LIMIT row_count OFFSET offset`

In [ ]:
%%sql
SELECT
	trackId,
	name
FROM
	tracks
LIMIT 15, 10

Getting the highest OR the lowest value

The following statement returns the second-longest track in the tracks table.

In [ ]:
%%sql
SELECT
	trackid,
	name,
	milliseconds
FROM
	tracks
ORDER BY
	milliseconds DESC
LIMIT 1 OFFSET 1

**SQLite BETWEEN**

The following statement finds invoices whose total is `between` 14.96 and 18.86:

In [ ]:
%%sql
SELECT
    InvoiceId,
    BillingAddress,
    Total
FROM
    invoices
WHERE
    Total BETWEEN 14.91 and 18.86    
ORDER BY
    Total

To find the invoices whose total are not between 1 and 20, you use the `NOT BETWEEN` operator as shown in the following query:

In [ ]:
%%sql
SELECT
    InvoiceId,
    BillingAddress,
    Total
FROM
    invoices
WHERE
    Total NOT BETWEEN 1 and 20
ORDER BY
    Total

The following example finds invoices whose invoice dates are from `January 1 2010` and `January 31 2010`

In [ ]:
%%sql
SELECT
    InvoiceId,
    BillingAddress,
    InvoiceDate,
    Total
FROM
    invoices
WHERE
    InvoiceDate BETWEEN '2010-01-01' AND '2010-01-31'
ORDER BY
    InvoiceDate

**SQLite IN**

In [ ]:
%%sql
SELECT
	TrackId,
	Name,
	Mediatypeid
FROM
	Tracks
WHERE
	MediaTypeId IN (1, 2)
ORDER BY
	Name ASC

This query uses the `OR` operator instead of the `IN` operator to return the same result set as the above query:

In [ ]:
%%sql
SELECT
	TrackId,
	Name,
	MediaTypeId
FROM
	Tracks
WHERE
	MediaTypeId = 1 OR MediaTypeId = 2
ORDER BY
	Name ASC

To get the tracks that belong to the artist id 12, you can combine the `IN` operator with a subquery as follows:

In [ ]:
%%sql
SELECT
	TrackId, 
	Name, 
	AlbumId
FROM
	Tracks
WHERE
	AlbumId IN (
		SELECT
			AlbumId
		FROM
			Albums
		WHERE
			ArtistId = 12
	)

**SQLite NOT IN examples**
The following statement returns a list of tracks whose genre id is not in a list of (1,2,3).

In [ ]:
%%sql
SELECT
	trackid,
	name,
	genreid
FROM
	tracks
WHERE
	genreid NOT IN (1, 2,3)

**SQLite LIKE**

To find the tracks whose names start with the `Wild` literal string, you use the percent sign `%` wildcard at the end of the pattern.

In [ ]:
%%sql
SELECT
	trackid,
	name	
FROM
	tracks
WHERE
	name LIKE 'Wild%'

To find the tracks whose names end with `Wild` word, you use `%` wildcard at the beginning of the pattern.

In [ ]:
%%sql
SELECT
	trackid,
	name
FROM
	tracks
WHERE
	name LIKE '%Wild'

To find the tracks whose names contain the `Wild` literal string, you use `%` wildcard at the beginning and end of the pattern:

In [ ]:
%%sql
SELECT
	trackid,
	name	
FROM
	tracks
WHERE
	name LIKE '%Wild%'

The following statement finds the tracks whose names contain: zero or more characters (`%`), followed by `Br`, followed by a character ( `_`), followed by `wn`, and followed by zero or more characters ( `%`).

In [ ]:
%%sql
SELECT
	trackid,
	name
FROM
	tracks
WHERE
	name LIKE '%Br_wn%'

In [ ]:
%%sql
SELECT
trackId,
name
FROM
tracks
WHERE name REGEXP 'wn$'

How to get the record witj missing values?

SQLite IS NULL

In [ ]:
%%sql
SELECT
    Name, 
    Composer
FROM
    tracks
WHERE
    Composer IS NULL
ORDER BY 
    Name

SQLite IS NOT NULL operator

In [ ]:
%%sql
SELECT
    Name, 
    Composer
FROM
    tracks
WHERE
    Composer IS NOT NULL

**SQLite Join**
So far we selected column from single tables
In the real world,  we need select columns from multple tables.

**Inner Join:**
In the example below, the `INNER JOIN` clause matches each row from the `albums` table with every row from the `artists` table based on the `join` condition (`artists.ArtistId = albums.ArtistId`) specified after the `ON` keyword.

In [ ]:
%%sql
SELECT 
  Title,
  Name
FROM 
  Albums
INNER JOIN artists
ON artists.ArtistId = albums.ArtistId

This query uses table aliases (`l` for the `albums` table and `r` for `artists` table) to shorten the query:

In [ ]:
%%sql
SELECT
    l.Title, 
    r.Name
FROM
    albums l
INNER JOIN artists r ON
    r.ArtistId = l.ArtistId

In case the column names of joined tables are the same e.g., `ArtistId`, you can use the `USING` syntax as follows:

The clause `USING(ArtistId)` is equipvalent to the clause `ON artists.ArtistId = albums.ArtistId`.

In [ ]:
%%sql
SELECT
   Title, 
   Name
FROM
   albums
INNER JOIN artists USING(ArtistId)

The `INNER JOIN` clause combines columns from correlated tables.

Suppose you have two tables: `A` and `B`.

A has `a1`, `a2`, and `f` columns. `B` has `b1`, `b2`, and `f` column. The `A` table links to the `B` table using a foreign key column named `f`.

The following illustrates the syntax of the `inner join` clause:



`SELECT a1, a2, b1, b2`

`FROM A`

`INNER JOIN B on B.f = A.f`


For each row in the A table, the `INNER JOIN` clause compares the value of the f column with the value of the f column in the B table. If the value of the f column in the A table equals the value of the f column in the B table, it combines data from a1, a2, b1, b2, columns and includes this row in the result set.

Let’s take a look at the `tracks` and `albums` tables in the sample database. The `tracks` table links to the `albums` table via `AlbumId` column.

In the `tracks` table, the `AlbumId` column is a foreign key. And in the `albums` table, the `AlbumId` is the primary key.

*If SQLite finds a match, it combines data of rows in both tables in the result set.*

In [ ]:
%%sql
SELECT
	trackid,
	name,
	title
FROM
	tracks
INNER JOIN albums ON albums.albumid = tracks.albumid

If you want to include the AlbumID, you have to define a name by `AS` function

In [ ]:
%%sql
SELECT
    trackid,
    name,
    tracks.albumid AS album_id_tracks,
    albums.albumid AS album_id_albums,
    title
FROM
    tracks
    INNER JOIN albums ON albums.albumid = tracks.albumid

`SQLite inner join – 3 tables example`
Tables: `tracks`, `albums`, `artists`

One track belongs to one album and one album have many tracks. The `tracks` table associated with the `albums` table via `albumid` column.

One album belongs to one artist and one artist has one or many albums. The `albums` table links to the `artists` table via `artistid` column.

In [ ]:
%%sql
SELECT
    trackid,
    tracks.name AS track,
    albums.title AS album,
    artists.name AS artist
FROM
    tracks
    INNER JOIN albums ON albums.albumid = tracks.albumid
    INNER JOIN artists ON artists.artistid = albums.artistid
    LIMIT 10

You can use a `WHERE` clause to get the tracks and albums of the artist with id 10 as the following statement:

In [ ]:
%%sql
SELECT
	trackid,
	tracks.name AS Track,
	albums.title AS Album,
	artists.name AS Artist
FROM
	tracks
INNER JOIN albums ON albums.albumid = tracks.albumid
INNER JOIN artists ON artists.artistid = albums.artistid
WHERE
	artists.artistid = 10

**Left Join**
The`LEFT JOIN` clause selects data starting from the left table (`artists`) and matching rows in the right table (`albums`) based on the join condition (`artists.ArtistId = albums.ArtistId`) .

In [ ]:
%%sql
SELECT
    Name, 
    Title
FROM
    artists
LEFT JOIN albums ON
    artists.ArtistId = albums.ArtistId
ORDER BY Name

If you want to find artists who don’t have any albums, you can add a WHERE clause as shown in the following query:

In [ ]:
%%sql
SELECT
    Name,
    Title
FROM
    artists
LEFT JOIN albums ON
    artists.ArtistId = albums.ArtistId
WHERE Title IS NULL   
ORDER BY Name

Suppose we have two tables: A and B.

All rows in table A are included in the result set whether there are matching rows in table B or not.

The statement returns a result set that includes:

1.   Rows in table A (left table) that have corresponding rows in table B.
2.   Rows in the table A table and the rows in the table B filled with NULL values in case the row from table A does not have any corresponding rows in table B.

In other words, all rows in table A are included in the result set whether there are matching rows in table B or not.

One album belongs to one artist. However, one artist may have zero or more albums.

To find artists who do not have any albums by using the `LEFT JOIN` clause, we select artists and their corresponding albums. If an artist does not have any albums, the value of the `AlbumId` column is `NULL`.

To display the artists who do not have any albums first, we have two choices:

First, use ORDER BY clause to list the rows whose AlbumId is NULL values first.

In [ ]:
%%sql
SELECT
   artists.ArtistId
   , AlbumId
FROM
   artists
LEFT JOIN albums ON
   albums.ArtistId = artists.ArtistId
WHERE
   AlbumId IS NULL

In [ ]:
%%sql
SELECT COUNT(*)
FROM Artists

# Practice by Szymon

which track is sold the largest number of times

In [ ]:
%%sql
SELECT
InvoiceLineId,
InvoiceId,
TrackId,
unitprice,
quantity,
unitprice * quantity AS "Number_of_Sell"
FROM
  invoice_items
ORDER BY Number_of_Sell
LIMIT 20

which genre of music brings the highest income

In [ ]:
%%sql
SELECT COUNT(*)
FROM
invoice_items